# -*- coding:utf-8 -*-
# AUTHER   @ Alvin



# abs() 函数返回数字的绝对值。
# divmod() 函数把除数和余数运算结果结合起来，返回一个包含商和余数的元组(a // b, a % b)。
# eval() 函数用来执行一个字符串表达式，并返回表达式的值。
# input 用来获取控制台的输入。
# open() 函数用于打开一个文件，创建一个 file 对象，相关的方法才可以调用它进行读写。
# file() 函数用于创建一个 file 对象，它有一个别名叫 open()，更形象一些，它们是内置函数。参数是以字符串的形式传递的。
# staticmethod 返回函数的静态方法。
# ord() 返回对应的 ASCII 数值
# str() 函数将对象转化为适于人阅读的形式。
# any() 函数用于判断给定的可迭代参数 iterable 是否全部为空对象，如果都为空、0、false，则返回 False，如果不都为空、0、false，则返回 True。
# eval() 函数用来执行一个字符串表达式，并返回表达式的值。
# isinstance() 函数来判断一个对象是否是一个已知的类型，类似 type()。
# pow() 方法返回 xy（x的y次方） 的值。
# sum() 方法对系列进行求和计算。
# basestring() 方法是 str 和 unicode 的超类（父类），也是抽象类，因此不能被调用和实例化，但可以被用来判断一个对象是否为 str 或者 unicode 的实例
# execfile() 函数可以用来执行一个文件。
# issubclass() 方法用于判断参数 class 是否是类型参数 classinfo 的子类。
# print() 方法用于打印输出，最常见的一个函数。
# super() 函数用于调用下一个父类(超类)并返回该父类实例的方法。
# bin() 返回一个整数 int 或者长整数 long int 的二进制表示。
# iter() 函数用来生成迭代器。
# property() 函数的作用是在新式类中返回属性值。
# tuple() 函数将列表转换为元组。
# bool() 函数用于将给定参数转换为布尔类型，如果没有参数，返回 False。
# filter() 函数用于过滤序列，过滤掉不符合条件的元素，返回由符合条件元素组成的新列表。
# len() 方法返回对象（字符、列表、元组等）长度或项目个数。
# range() 函数可创建一个整数列表，一般用在 for 循环中。
# type() 函数如果你只有第一个参数则返回对象的类型，三个参数返回新的类型对象。
# bytearray() 方法返回一个新字节数组。这个数组里的元素是可变的，并且每个元素的值范围: 0 <= x < 256。
# float() 函数用于将整数和字符串转换成浮点数。
# list() 方法用于将元组转换为列表。
# raw_input() 用来获取控制台的输入。
# unichr() 函数 和 chr()函数功能基本一样， 只不过是返回 unicode 的字符。
# callable() 函数用于检查一个对象是否是可调用的。如果返回True，object仍然可能调用失败；但如果返回False，调用对象ojbect绝对不会成功。
# format 函数可以接受不限个参数，位置可以不按顺序。
# locals() 函数会以字典类型返回当前位置的全部局部变量。
# reduce() 函数会对参数序列中元素进行累积。
# chr() 用一个范围在 range（256）内的（就是0～255）整数作参数，返回一个对应的字符。
# frozenset() 返回一个冻结的集合，冻结后集合不能再添加或删除任何元素。
# long() 函数将数字或字符串转换为一个长整型。









# __import__() 函数用于动态加载类和函数 。如果一个模块经常变化就可以使用 __import__() 来动态载入。












